nRFMesh/nRF52_Mesh/drivers/mesh.c
void mesh_tx_light(uint32_t light)
{
    mesh_bcast_data(Mesh_Pid_Light,(uint8_t*)&light,4);
}

void mesh_tx_battery(uint16_t voltage)
{
    uint8_t data[2];
    data[0] = 0xFF & (uint8_t)(voltage >> 8);
    data[1] = 0xFF & (uint8_t)(voltage);
    mesh_bcast_data(Mesh_Pid_Battery,data,2);
}

void mesh_tx_bme(int32_t temp,uint32_t hum,uint32_t press)
{
    uint8_t data[12];
    data[0] = 0xFF & (uint8_t)(temp >> 24);
    data[1] = 0xFF & (uint8_t)(temp >> 16);
    data[2] = 0xFF & (uint8_t)(temp >> 8);
    data[3] = 0xFF & (uint8_t)(temp );
    data[4] = 0xFF & (uint8_t)(hum >> 24);
    data[5] = 0xFF & (uint8_t)(hum >> 16);
    data[6] = 0xFF & (uint8_t)(hum >> 8);
    data[7] = 0xFF & (uint8_t)(hum );
    data[8] = 0xFF & (uint8_t)(press >> 24);
    data[9] = 0xFF & (uint8_t)(press >> 16);
    data[10]= 0xFF & (uint8_t)(press >> 8);
    data[11]= 0xFF & (uint8_t)(press );
    mesh_bcast_data(Mesh_Pid_bme,data,12);
}

//----------------------------------------------------------------------------
//------------------------- Messages Deserialisation -------------------------
//----------------------------------------------------------------------------


int rx_alive(char * p_msg,uint8_t*data,uint8_t size)
{
    if(size == 0)
    {
        return sprintf(p_msg,"alive:1");
    }
    else if(size == 5)
    {
        uint32_t live_count;
        live_count  = data[0] << 24;
        live_count |= data[1] << 16;
        live_count |= data[2] << 8;
        live_count |= data[3];
        uint8_t tx_power = data[4];
        return sprintf(p_msg,"alive:%lu;tx_power:%d",live_count,tx_power);
    }
    else
    {
        return sprintf(p_msg,"size not 0, not 5 but:%d",size);
    }
}

int rx_button(char * p_msg,uint8_t*data,uint8_t size)
{
    if(size != 1)
    {
        return sprintf(p_msg,"size not 1 but:%u",size);
    }
    else
    {
        return sprintf(p_msg,"button:%u",data[0]);
    }
}

/**
 * @brief Converts the light from 4 Big endien uint32_t mili-lux to printed float
 * 
 * @param p_msg output of the printed param:val
 * @param data pointer on the payload of the light parameter bytes
 * @param size size of the payload to assert the protocol coherency
 * @return int length of the printed string
 */
int rx_light(char * p_msg,uint8_t*data,uint8_t size)
{
    if(size == 2)
    {
        uint16_t    light  = data[1] << 8;
                    light |= data[0];
        return sprintf(p_msg,"deprecated_light:%u",light);
    }
    else if(size == 4)
    {
        uint32_t    light  = data[3] << 24;
                    light |= data[2] << 16;
                    light |= data[1] <<  8;
                    light |= data[0];
        float f_light = light;
        f_light /= 1000;
        return sprintf(p_msg,"light:%.03f",f_light);
    }
    else
    {
        return sprintf(p_msg,"size not 4, not 2 but:%d",size);
    }
}

int rx_new_light(char * p_msg,uint8_t*data,uint8_t size)
{
    if(size == 2)
    {
        uint16_t    light  = data[1] << 8;
                    light |= data[0];
        return sprintf(p_msg,"deprecated_new_light:%u",light);
    }
    else
    {
        return sprintf(p_msg,"size not 2 but:%d",size);
    }
}

int rx_led_rgb(char * p_msg,uint8_t*data,uint8_t size)
{
    if(size == 3)
    {
        uint8_t    red  =      data[0];
        uint8_t    green  =    data[1];
        uint8_t    blue  =     data[2];
        return sprintf(p_msg,"led_r:%u;led_g:%u;led_b:%u",red,green,blue);
    }
    else if(size == 0)
    {
        return 0;//no addition as this is an ack
    }
    else
    {
        return sprintf(p_msg,"size not 8, not 0 but:%u",size);
    }
}

int rx_light_rgb(char * p_msg,uint8_t*data,uint8_t size)
{
    if(size != 8)
    {
        return sprintf(p_msg,"size not 8 but:%u",size);
    }
    else
    {
        uint16_t    ambient  =  data[0] << 8;
                    ambient |=  data[1];
        uint16_t    red  =      data[2] << 8;
                    red |=      data[3];
        uint16_t    green  =    data[4] << 8;
                    green |=    data[5];
        uint16_t    blue  =     data[6] << 8;
                    blue |=     data[7];
        return sprintf(p_msg,"ambient:%u;red:%u;green:%u;blue:%u",ambient,red,green,blue);
    }
}

int rx_temperature(char * p_msg,uint8_t*data,uint8_t size)
{
    if(size != 4)
    {
        return sprintf(p_msg,"size not 4 but:%d",size);
    }
    else
    {
        uint32_t    temperature  = data[3] << 24;
                    temperature |= data[2] << 16;
                    temperature |= data[1] <<  8;
                    temperature |= data[0];
        return sprintf(p_msg,"deprecated_temp:%lu",temperature);
    }
}

int rx_humidity(char * p_msg,uint8_t*data,uint8_t size)
{
    if(size != 4)
    {
        return sprintf(p_msg,"size not 4 but:%d",size);
    }
    else
    {
        uint32_t    humidity  = data[3] << 24;
                    humidity |= data[2] << 16;
                    humidity |= data[1] <<  8;
                    humidity |= data[0];
        return sprintf(p_msg,"deprecated_hum:%lu",humidity);
    }
}

int rx_pressure(char * p_msg,uint8_t*data,uint8_t size)
{
    if(size != 4)
    {
        return sprintf(p_msg,"size not 4 but:%d",size);
    }
    else
    {
        uint32_t    pressure  = data[3] << 24;
                    pressure |= data[2] << 16;
                    pressure |= data[1] <<  8;
                    pressure |= data[0];
        return sprintf(p_msg,"deprecated_press:%lu",pressure);
    }
}

int rx_bme(char * p_msg,uint8_t*data,uint8_t size)
{
    if(size != 12)
    {
        if(size == 8)
        {
            int add = sprintf(p_msg,"deprecated_bme_reg:");
            p_msg += add;
            add+=sprint_buf(p_msg,(const char*)data,size);
            return add;
        }
        else
        {
            return sprintf(p_msg,"size not 12 but:%u",size);
        }
    }
    else
    {
        int32_t temp  = data[0] << 24;
                temp |= data[1] << 16;
                temp |= data[2] <<  8;
                temp |= data[3];
        int32_t mst = temp / 100;
        int32_t lst = temp % 100;
        if(lst<0)
        {
            lst*=-1;
        }
        uint32_t hum  = data[4] << 24;
                hum |= data[5] << 16;
                hum |= data[6] <<  8;
                hum |= data[7];
        uint32_t msh = hum>>10;
        uint32_t lsh = hum & 0x3FF;
        uint32_t press  = data[8]  << 24;
                press |= data[9]  << 16;
                press |= data[10] <<  8;
                press |= data[11];
        uint32_t msp = press / (256 * 100);
        uint32_t lsp = (press/256) % 100;
        return sprintf(p_msg,"temp:%ld.%02ld;hum:%lu.%03lu;press:%lu.%02lu",mst,lst,msh,lsh,msp,lsp);
    }
}

int rx_battery(char * p_msg,uint8_t*data,uint8_t size)
{
    if(size != 2)
    {
        return sprintf(p_msg,"size not 2 but:%d",size);
    }
    else
    {
        uint16_t 	bat_val = data[0] << 8;
                    bat_val |= data[1];
        uint16_t msv = bat_val / 1000;
        uint16_t lsv = bat_val % 1000;
        return sprintf(p_msg,"battery:%u.%03u",msv,lsv);
    }
}

int rx_accell(char * p_msg,uint8_t*data,uint8_t size)
{
    if(size != 6)
    {
        return sprintf(p_msg,"size not 6 but:%d",size);
    }
    else
    {
        int16_t 	accell_x =  data[0] << 8;
                    accell_x |= data[1];
        int16_t 	accell_y =  data[2] << 8;
                    accell_y |= data[3];
        int16_t 	accell_z =  data[4] << 8;
                    accell_z |= data[5];
        float   x =  accell_x;
                x /= 16384;
        float   y =  accell_y;
                y /= 16384;
        float   z =  accell_z;
                z /= 16384;
        //note only +-2g AFS is used
        //although one lsb is 0.00006 it is truncated to 0.001
        int sres = sprintf(p_msg,"accx:%0.3f;accy:%0.3f;accz:%0.3f",x,y,z);
        return sres;
    }
}

void mesh_parse(message_t* msg,char * p_msg)
{ 
    p_msg += sprintf(  p_msg,"rssi:-%d;pid:%d;ctrl:0x%02X;src:%d;",msg->rssi,msg->pid,msg->control,msg->source);
    if(!(MESH_IS_BROADCAST(msg->control)))
    {
        p_msg += sprintf(  p_msg,"dest:%d;",msg->dest);
    }
    if(MESH_IS_ACKNOWLEDGE(msg->control))
    {
        p_msg += sprintf(  p_msg,"ack:1;");
    }
    switch(msg->pid)
    {
        case Mesh_Pid_Alive:
            {
                p_msg += rx_alive(p_msg,msg->payload,msg->payload_length);
            }
            break;
        case Mesh_Pid_Reset:
            {
                p_msg += sprintf(p_msg,"reset:1");
            }
            break;
        case Mesh_Pid_Button:
            {
                p_msg += rx_button(p_msg,msg->payload,msg->payload_length);
            }
            break;
        case Mesh_Pid_Light:
            {
                p_msg += rx_light(p_msg,msg->payload,msg->payload_length);
            }
            break;
        case Mesh_Pid_light_rgb:
            {
                p_msg += rx_light_rgb(p_msg,msg->payload,msg->payload_length);
            }
            break;
        case Mesh_Pid_led_rgb:
            {
                p_msg += rx_led_rgb(p_msg,msg->payload,msg->payload_length);
            }
            break;
        case Mesh_Pid_Temperature:
        {
                p_msg += rx_temperature(p_msg,msg->payload,msg->payload_length);
        }
        break;
        case Mesh_Pid_Humidity:
        {
                p_msg += rx_humidity(p_msg,msg->payload,msg->payload_length);
        }
        break;
        case Mesh_Pid_Pressure:
        {
                p_msg += rx_pressure(p_msg,msg->payload,msg->payload_length);
        }
        break;
        case Mesh_Pid_bme:
            {
                p_msg += rx_bme(p_msg,msg->payload,msg->payload_length);
            }
            break;
        case Mesh_Pid_accell:
            {
                p_msg += rx_accell(p_msg,msg->payload,msg->payload_length);
            }
            break;
        case Mesh_Pid_Battery:
            {
                p_msg += rx_battery(p_msg,msg->payload,msg->payload_length);
            }
            break;
        case Mesh_Pid_new_light:
            {
                p_msg += rx_new_light(p_msg,msg->payload,msg->payload_length);
            }
            break;
            
        case Mesh_Pid_ExecuteCmd:
            {
                if(MESH_IS_RESPONSE(msg->control))
                {
                    p_msg += cmd_parse_response(p_msg,msg->payload,msg->payload_length);
                }
                else//request
                {
                    if(UICR_is_rf_cmd())
                    {
                        mesh_execute_cmd(msg->payload,msg->payload_length,true,msg->source);
                    }
                }
            }
            break;
        default:
        {
            if(msg->payload_length > 0)
            {
                p_msg += sprintf(p_msg,"payload:");
                p_msg += sprint_buf(p_msg,(const char*)msg->payload,msg->payload_length);
            }
        }
        break;
    }
    sprintf(p_msg,"\r\n");
}

void mesh_parse_raw(message_t* msg,char * p_msg)
{ 
    int add;
    add = sprintf(p_msg,"rssi:-%d;nodeid:%d;control:0x%02X",msg->rssi,msg->source,msg->control);
    p_msg += add;
    if(msg->pid <= 0x15)//sizeof(pid_name)
    {
        add = sprintf(p_msg,";pid:%s",pid_name[msg->pid]);
        p_msg += add;
    }
    else
    {
        add = sprintf(p_msg,";pid:0x%02X",msg->pid);
        p_msg += add;
    }
    if(msg->payload_length > 0)
    {
        add = sprintf(p_msg,";length:%d;data:0x",msg->payload_length);
        p_msg += add;
    }
    for(int i=0;i<msg->payload_length;i++)
    {
        add = sprintf(p_msg,"%02X ",msg->payload[i]);
        p_msg += add;
    }
    sprintf(p_msg,"\r\n");
}

